| user_id | transaction_id | product_id | quantity | price | transaction_date     |
|---------|----------------|------------|----------|-------|----------------------|
| 1       | 101            | A          | 2        | 20.0  | 2023-01-15 10:05:00  |
| 2       | 102            | B          | 1        | 15.0  | 2023-01-16 11:15:00  |
| 1       | 103            | A          | 1        | 20.0  | 2023-01-17 12:10:00  |
| 3       | 104            | C          | 4        | 5.0   | 2023-01-18 14:30:00  |
| 2       | 105            | B          | 2        | 15.0  | 2023-01-19 15:45:00  |

In [1]:
import pandas as pd

# Sample data
data = {
    'user_id': [1, 2, 1, 3, 2],
    'transaction_id': [101, 102, 103, 104, 105],
    'product_id': ['A', 'B', 'A', 'C', 'B'],
    'quantity': [2, 1, 1, 4, 2],
    'price': [20.0, 15.0, 20.0, 5.0, 15.0],
    'transaction_date': [
        '2023-01-15 10:05:00',
        '2023-01-16 11:15:00',
        '2023-01-17 12:10:00',
        '2023-01-18 14:30:00',
        '2023-01-19 15:45:00'
    ]
}

# Convert the dictionary to a DataFrame
df = pd.DataFrame(data)

# Convert 'transaction_date' to datetime format
df['transaction_date'] = pd.to_datetime(df['transaction_date'])

print(df)

   user_id  transaction_id product_id  quantity  price    transaction_date
0        1             101          A         2   20.0 2023-01-15 10:05:00
1        2             102          B         1   15.0 2023-01-16 11:15:00
2        1             103          A         1   20.0 2023-01-17 12:10:00
3        3             104          C         4    5.0 2023-01-18 14:30:00
4        2             105          B         2   15.0 2023-01-19 15:45:00

Total Spend per User: Create a new column called total_spend representing the total amount spent per transaction. Then calculate the total spend per user, returning a DataFrame with two columns: user_id and total_spent.

In [2]:
df['total_spend'] =df['quantity'] * df['price']

In [6]:
df.groupby('user_id')['total_spend'].sum().reset_index()

   user_id  total_spend
0        1         60.0
1        2         45.0
2        3         20.0

In [7]:
###################################################

In [8]:
import pandas as pd

data = {
    'department': ['Sales', 'Sales', 'IT', 'HR', 'HR', 'IT', 'Sales'],
    'employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace'],
    'salary': [70000, 60000, 90000, 50000, 55000, 85000, 75000],
    'bonus': [5000, 3000, 8000, 2000, 2500, 7000, 4000]
}

df = pd.DataFrame(data)
print(df)

  department employee  salary  bonus
0      Sales    Alice   70000   5000
1      Sales      Bob   60000   3000
2         IT  Charlie   90000   8000
3         HR    David   50000   2000
4         HR      Eva   55000   2500
5         IT    Frank   85000   7000
6      Sales    Grace   75000   4000

The basic syntax of groupby involves specifying one or more columns to group by:

In [9]:
grouped = df.groupby('department')
grouped

Applying Aggregation Functions

In [10]:
grouped['salary'].sum()

department
HR       105000
IT       175000
Sales    205000
Name: salary, dtype: int64

In [12]:
grouped['salary'].sum()

department
HR       105000
IT       175000
Sales    205000
Name: salary, dtype: int64

In [13]:
stats = grouped.agg({
    'salary': 'mean',
    'bonus': 'sum'
})
print(stats)

                  salary  bonus
department
HR          52500.000000   4500
IT          87500.000000  15000
Sales       68333.333333  12000